JoseTrinidadLM/GRID_FORMING_STM32F446RE_PA/GRID_FORMING/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

/*
 *  PA0 -> ADC1 -> DMA -> raw_sensor_value[0] -> characterized sensor outputs
 *			^
 *			|
 * 			TIM2
 *
 *	ClosedLoop/OpenLoop Operation Mode -> dutyCycle -> PWM
 *
 *
 */

/*
 * USART 2->STLINK
 *
 * TX->PA2
 * RX->PA3
 *
 */

#include <string.h>
#include "stm32f446xx.h"

uint64_t BUFFER_SIZE = 9;

/*characterized sensor outputs*/
float v_cd;
float v_g;
float i_L;
float i_L90;
float i_inv;

uint32_t raw_sensor_value[4];

float ElapsedTime=0;	//Elapsed time variable

float packets_value[5]; 	//Data packet to be sent via UART
int valid_send = 1;		//Flag to indicate when data packet is ready to be sent

uint8_t heartbeat[2];

/*sine wave for DQ and power-factor correction*/
float cosine;
float sine;

float i_Q;


/*modulator signal*/
__vo uint16_t u_control_pos;
__vo uint16_t u_control_neg;


uint8_t OPERATION_MODE = 0;

uint8_t heartbeat[5];
uint8_t telemetry[35];

uint8_t dma_ready;
uint8_t telemetry_status;
uint8_t heartbeat_status;

#define DMA_TR_NONE			0
#define DMA_TR_TELEMETRY	1
#define DMA_TR_HEARTBEAT	2

uint8_t dma_transfer_mode = DMA_TR_NONE;

/*This function set the values for USART buffer*/
void USART_SetBuffer()
{
	if (valid_send == 1) {
		packets_value[0] = v_g;
		packets_value[1] = i_L ;
		packets_value[2] = i_inv;
		packets_value[3] = v_cd;
		packets_value[4] = ElapsedTime;
		valid_send = 0;
		Protocol_Telemetry_EN();
	}else {
		valid_send = 1;
	}
}

/*This function resets the value of Elapsed time*/
void ResetTime(void)
{
	ElapsedTime = 0;
}

GPIO_Handle_t LED;

void LED_GPIOInits(void)
{
	LED.pGPIOx = GPIOA;
	LED.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
	//LED.GPIO_PinConfig.GPIO_PinAltFunMode = 2;
	LED.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
	LED.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
	LED.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
	//LED D13
	LED.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_5;
	GPIO_Init(&LED);
}

void USART2_Inits(USART_Handle_t *pUSART2Handle)
{
	pUSART2Handle->pUSARTx = USART2;
	pUSART2Handle->USARTConfig.USART_Baud = 2200000;
	pUSART2Handle->USARTConfig.USART_HWFlowControl = USART_HW_FC_NONE;
	pUSART2Handle->USARTConfig.USART_Mode = USART_MODE_TX_RX;
	pUSART2Handle->USARTConfig.USART_NoOfStopBits = USART_1_STOPBITS;
	pUSART2Handle->USARTConfig.USART_ParityControl = USART_PARITY_DISABLE;
	pUSART2Handle->USARTConfig.USART_WordLength = USART_WLEN_8BITS;
	pUSART2Handle->USARTConfig.USART_DMA = USART_DMA_TX_RX;

	USART_Init(pUSART2Handle);
}

void DMA1_Inits(void)
{
	//DMA1 Channel 4 Stream 6 USART2 TX
	DMA1_TX2Handle.pDMAx = DMA1;
	DMA1_TX2Handle.DMA_stream = 6;
	DMA1_TX2Handle.DMA_Config.DMA_Channel = DMA_CHANNEL_4;
	DMA1_TX2Handle.DMA_Config.DMA_Direction = DMA_DIR_MEM_TO_PERIPH;
	DMA1_TX2Handle.DMA_Config.DMA_Priority = DMA_PRIORITY_MEDIUM;
	DMA1_TX2Handle.DMA_Config.DMA_MemDataSize = DMA_DATA_SIZE_BYTE;
	DMA1_TX2Handle.DMA_Config.DMA_PeriphDataSize = DMA_DATA_SIZE_BYTE;
	DMA1_TX2Handle.DMA_Config.DMA_MemInc = ENABLE;
	DMA1_TX2Handle.DMA_Config.DMA_PeriphInc = DISABLE;
	DMA1_TX2Handle.DMA_Config.DMA_FIFOMode = DMA_FIFO_MODE_DISABLED;
	DMA1_TX2Handle.DMA_Config.DMA_FIFOThreshold = 0;
	DMA1_TX2Handle.DMA_Config.DMA_Mode = DMA_MODE_NORMAL;
	DMA1_TX2Handle.DMA_Config.DMA_TransferIT = ENABLE;
	DMA1_TX2Handle.BufferSize = 4;

	DMA_Init(&DMA1_TX2Handle);

	//DMA1 Channel 4 Stream 5 USART2 RX
	DMA1_RX2Handle.pDMAx = DMA1;
	DMA1_RX2Handle.DMA_stream = 5;
	DMA1_RX2Handle.DMA_Config.DMA_Channel = DMA_CHANNEL_4;
	DMA1_RX2Handle.DMA_Config.DMA_Direction = DMA_DIR_PERIPH_TO_MEM;
	DMA1_RX2Handle.DMA_Config.DMA_MemDataSize = DMA_DATA_SIZE_BYTE;
	DMA1_RX2Handle.DMA_Config.DMA_PeriphDataSize = DMA_DATA_SIZE_BYTE;
	DMA1_RX2Handle.DMA_Config.DMA_MemInc = ENABLE;
	DMA1_RX2Handle.DMA_Config.DMA_PeriphInc = DISABLE;
	DMA1_RX2Handle.DMA_Config.DMA_FIFOMode = DMA_FIFO_MODE_DISABLED;
	DMA1_RX2Handle.DMA_Config.DMA_FIFOThreshold = 0;
	DMA1_RX2Handle.DMA_Config.DMA_Mode = DMA_MODE_CIRCULAR;
	DMA1_RX2Handle.DMA_Config.DMA_TransferIT = ENABLE;
	DMA1_RX2Handle.BufferSize = 3;

	DMA_Init(&DMA1_RX2Handle);
	DMA_SetAddresses(&DMA1_RX2Handle, (void*)&USART2Handle.pUSARTx->DR, (void*)receive_data);
	DMA_StartTransfer(&DMA1_RX2Handle);
}

void USART_HeartBeatTX(void);
void USART_TelemetryTX(void);

int main(void)
{
	SystemCLK_Config_84MHz();

	SCB_CPACR |= ((3UL << 10*2) | (3UL << 11*2)); //FPU Enabled

	Utility_GPIOInits();
	PWM_GPIOInits();
	Sensors_Init((void*)raw_sensor_value);
	SamplingRateTIMInit(9600);
	PWM_TIMInits(9600);

	ProtocolInit(USART2, GPIOA, GPIOA, GPIO_PIN_NO_2, GPIO_PIN_NO_3, packets_value, heartbeat);
	Protocol_TIMInit(TIM3);
	Protocol_Start();

	//Call Protocol_Telemetry_EN() to send values in @packets_value

	LED_GPIOInits();

	Protocol_Telemetry_EN();

	//DMA 1 Channel 4 Stream 5 & 6
	DMA1_Inits();
	DMA_IRQInterruptConfig(IRQ_NO_DMA1_STREAM6,ENABLE);
	DMA_IRQPriorityConfig(IRQ_NO_DMA1_STREAM6,NVIC_IRQ_PRI1);
	DMA_IRQInterruptConfig(IRQ_NO_DMA1_STREAM5,ENABLE);
	DMA_IRQPriorityConfig(IRQ_NO_DMA1_STREAM5,NVIC_IRQ_PRI1);

	heartbeatStructure();
	telemetryStructure();

	TIM_Start(&TIM3Handle);

	dma_ready = ENABLE;

	while(1)
	{
		Protocol_HeartBeat();
		Protocol_Telemetry();
	}
	return 0;
}

void TIM3_IRQHandler(void)
{
	Protocol_HearBeat_EN();
	Protocol_TIMx_IRQHandling();
}

void DMA1_Stream6_IRQHandler(void)
{
	Protocol_DMAx_TX_IRQHandling();
}

void DMA1_Stream5_IRQHandler(void)
{
	Protocol_DMAx_RX_IRQHandling();
}


/*Buffers to store quarter of a period of cos and i_L*/
/*For every shifted signal it is needed a buffer*/
float cos_buffer[40] = {0};
float i_L_buffer[40] = {0};


/*Control global variables*/
__vo float e1_z_0 = 0;
__vo float e1_z_1 = 0;

__vo float e2_z_0 = 0;
__vo float e2_z_1 = 0;

__vo float y1_z_0 = 0;
__vo float y1_z_1 = 0;

__vo float y2_z_0 = 0;
__vo float y2_z_1 = 0;

void TIM2_IRQHandler(void)
{
	/*Flags and counters used for 90-degree shiftimg*/
	__vo static uint8_t Buffer_Counter_Cos = 0;
	__vo static uint8_t Buffer_Ready_Flag_Cos = 0;

	__vo static uint8_t Buffer_Counter_iL = 0;
	__vo static uint8_t Buffer_Ready_Flag_iL = 0;

	TIM2_IRQHandling();

	/*This are critical operations needed before shifting to Closed Loop Mode */

	/*TO DO: Read and characterize sensors */

	v_g = 	(raw_sensor_value[0]/4095.0f - 0.5f)*2.0f;
	i_inv = (raw_sensor_value[1]/4095.0f - 0.5f)*2.0f;
	i_L = 	(raw_sensor_value[2]/4095.0f - 0.5f)*2.0f;
	v_cd = 	(raw_sensor_value[3]/4095.0f - 0.5f)*2.0f;
	ElapsedTime = ElapsedTime + (1.0f/9600.0f);
	
	/*This is to refresh the packet_values in buffer for DMA*/
	USART_SetBuffer();

	/*In case there is a high presence of noise, signals will be filtered*/

	cosine = v_g;		//This is just an example to show its functionality

	sine = NINETYDegreePhaseShift(cos_buffer, cosine, &Buffer_Counter_Cos, &Buffer_Ready_Flag_Cos);

	i_L90 = NINETYDegreePhaseShift(i_L_buffer, i_L, &Buffer_Counter_iL, &Buffer_Ready_Flag_iL);
	
	i_Q = QTransform(cosine, sine, i_L, i_L90);

	if(OPERATION_MODE == 0)
	{
		OpenLoop(v_g, &u_control_pos, &u_control_neg);

	} else
	{
		CascadeControl(cosine, sine, v_cd, i_Q, i_inv, &e1_z_0, &e1_z_1, &e2_z_0, &e2_z_1, &y1_z_0, &y1_z_1, &y2_z_0, &y2_z_1, &u_control_pos, &u_control_neg);
	}

	PWM_dutyCycle_control(u_control_pos, u_control_neg);

}

/*This interruption can be triggered by GPIOB 14-15*/
void EXTI15_10_IRQHandler(void)
{
	static uint8_t PWM_ENABLE = 0;
	GPIO_IRQHandling(14);
	/*Both pins are read*/
	PWM_ENABLE = GPIO_ReadFromInputPin(GPIOB, 14);
	OPERATION_MODE = GPIO_ReadFromInputPin(GPIOB, 15);				//This lecture autmatically changes Operation Mode as: Open Loop when Operation Mode = 0, Closed Loop when 1


	/*When Operation Mode is zero it resets PI controllers from CascadeControl(), to assure safe and smooth transition to Closed Loop Mode Operation*/
	if( OPERATION_MODE == 0 )
	{
		ResetPIControllers(&e1_z_0, &e1_z_1, &e2_z_0, &e2_z_1, &y1_z_0, &y1_z_1, &y2_z_0, &y2_z_1);
		heartbeat[0] &= ~(1 << 0); //Set Loop Status Flag to Open 
	} else
	{
		heartbeat[0] |= (1 << 0); //Set Loop Status Flag to Closed
	}

	/*To disable PWM output, when PWM_ENABLE is 0 TIM5 (which controls PWM GPIO C7-A9) is stopped and both pins are reset. When PWM_ENABLE is 1 it starts TIM5 again*/
	if( PWM_ENABLE == 0 )
	{
		TIM_PWM_Disable(&TIM_4, &TIM4_PWM_Channel_1);
		TIM_PWM_Disable(&TIM_4, &TIM4_PWM_Channel_2);

		GPIO_WriteToOutputPin(GPIOB, GPIO_PIN_NO_7, RESET);
		GPIO_WriteToOutputPin(GPIOB, GPIO_PIN_NO_6, RESET);

		heartbeat[0] &= ~(1 << 1); //Set PWM Status Flag to Disabled

	} else if( PWM_ENABLE == 1 )
	{
		TIM_PWM_Enable(&TIM_4, &TIM4_PWM_Channel_1);
		TIM_PWM_Enable(&TIM_4, &TIM4_PWM_Channel_2);

		heartbeat[0] |= (1 << 1); //Set PWM Status Flag to Enabled

	}
}

void ShiftSensorsValue(void)
{
	for(uint64_t x = BUFFER_SIZE-1; x>0; x--)
	{
		//TO-DO: shift processed values
		;
	}
}


uint64_t comm[3] = {0}; //lo anadi para revisar que compilara

void USART_DecodeRX(USART_Handle_t *pUSARTHandle)
{
	comm[0] = receive_data[0];
	comm[1] = receive_data[1];
	comm[2] = receive_data[2];
	if(receive_data[0] == '$' && receive_data[1] == 'X')
	{
		executeCommand(receive_data[2]);
	}
}

void USART_HeartBeatTX(void)
{
	if(dma_ready == DISABLE) return;
	if(heartbeat_status == DISABLE) return;
	USART_ClearFlag(USART2Handle.pUSARTx, USART_TC_FLAG);
	heartbeat[3] = status;
	heartbeat[4] = frequency;

	dma_transfer_mode = DMA_TR_HEARTBEAT;

	DMA_SetAddresses(&DMA1_TX2Handle, (void*)heartbeat, (void*)&USART2Handle.pUSARTx->DR);
	DMA_ConfigureBuffer(&DMA1_TX2Handle, 5);
	DMA_StartTransfer(&DMA1_TX2Handle);
}

void USART_TelemetryTX(void)
{
	if(dma_ready == DISABLE) return;
	if(telemetry_status == DISABLE) return;
	USART_ClearFlag(USART2Handle.pUSARTx, USART_TC_FLAG);
	telemetry[3] = getValue_Variable('V', 0);
	telemetry[4] = getValue_Variable('V', 1);
	telemetry[5] = getValue_Variable('V', 2);
	telemetry[6] = getValue_Variable('V', 3);

	telemetry[10] = getValue_Variable('C', 0);
	telemetry[11] = getValue_Variable('C', 1);
	telemetry[12] = getValue_Variable('C', 2);
	telemetry[13] = getValue_Variable('C', 3);

	telemetry[17] = getValue_Variable('F', 0);
	telemetry[18] = getValue_Variable('F', 1);
	telemetry[19] = getValue_Variable('F', 2);
	telemetry[20] = getValue_Variable('F', 3);

	telemetry[24] = getValue_Variable('D', 0);
	telemetry[25] = getValue_Variable('D', 1);
	telemetry[26] = getValue_Variable('D', 2);
	telemetry[27] = getValue_Variable('D', 3);

	telemetry[31] = getValue_Variable('Z', 0);
	telemetry[32] = getValue_Variable('Z', 1);
	telemetry[33] = getValue_Variable('Z', 2);
	telemetry[34] = getValue_Variable('Z', 3);

	dma_transfer_mode = DMA_TR_TELEMETRY;

	DMA_SetAddresses(&DMA1_TX2Handle, (void*)telemetry, (void*)&USART2Handle.pUSARTx->DR);
	DMA_ConfigureBuffer(&DMA1_TX2Handle, 35);
	DMA_StartTransfer(&DMA1_TX2Handle);
}

void TIM3_IRQHandler(void)
{
	heartbeat_status = ENABLE;
	TIM_IRQHandling(&TIM3Handle);
}

void DMA_ApplicationEventCallback(DMA_Handle_t *pDMAHandle, uint8_t ApEv)
{
	if(ApEv == DMA_EVENT_TCIF_CMPLT)
	{
		if(pDMAHandle->DMA_stream == 6)
		{
			DMA_StopTransfer(&DMA1_TX2Handle);
			dma_ready = ENABLE;
			if(dma_transfer_mode == DMA_TR_HEARTBEAT)
			{
				heartbeat_status = DISABLE;
			}else if(dma_transfer_mode == DMA_TR_TELEMETRY )
			{
				telemetry_status = DISABLE;
			}
			dma_transfer_mode = DMA_TR_NONE;
		}
		if(pDMAHandle->DMA_stream == 5)
		{
			USART_DecodeRX(&USART2Handle);
		}
	}
}

void DMA1_Stream6_IRQHandler(void)
{
	DMA_IRQHandling(&DMA1_TX2Handle);
}

void DMA1_Stream5_IRQHandler(void)
{
	DMA_IRQHandling(&DMA1_RX2Handle);
}
